In [ ]:
Exercise 1 SQL
 
1 List all employees whose salary is between 1,000 and 2,000. Show 
employee name, department and salary

SELECT EMP.ENAME, D.DNAME, EMP.SAL FROM EMP 
JOIN DEPT D ON EMP.DEPTNO = D.DEPTNO
WHERE EMP.SAL BETWEEN 1000 AND 2000;
 
2 Display all the different types of occupations

SELECT DISTINCT DNAME
FROM DEPT
 
3 List details of employees in departments 10 and 30

SELECT DISTINCT *
FROM EMP
WHERE EMP.DEPTNO IN (10,30);
 
4 Display all employees who recruited during 1982, giving their 
name, department and hiredate.

SELECT *
FROM EMP
WHERE EXTRACT(YEAR FROM HIREDATE) = 1982;
 
5 List the employees whose names have 'th' or 'll' in them

SELECT ENAME
FROM EMP
WHERE ENAME LIKE '%LL%' OR ENAME LIKE '%TH%';
 
6 List the department numbers and names in department name order

SELECT DNAME, DEPTNO
FROM DEPT
ORDER BY DNAME
 
7 Find the names, jobs, salaries and commissions of all employees 
who do not have managers

SELECT ENAME, JOB, SAL, COMM
FROM EMP
WHERE MGR IS NULL
 
8 List all salesmen in descending order of their 
commission divided by their salary

SELECT *
    
FROM EMP
WHERE JOB = 'SALESMAN'
ORDER BY (COMM / SAL)DESC
 
9 Calculate the total annual compensation of all salesmen based 
upon their monthly salary and monthly commission
 
(sal+comm)*12

SELECT SUM(COALESCE(SAL,0)+COALESCE(COMM,0)*12) AS Total_Annual_Compensation
FROM EMP
WHERE JOB = 'SALESMAN'
 
10 Find all the salesmen in department 30 who have a salary 
greater than or equal to $1,500

SELECT ENAME, SAL
FROM EMP
WHERE JOB = 'SALESMAN' AND DEPTNO = 30 AND SAL >= 1500;

In [ ]:
exercise 2: functions
 
1) Find out how many managers there are without listing them. 

SELECT COUNT(*) AS MANAGERCOUNT
FROM EMP
WHERE JOB = 'MANAGER';
 
2) Compute the average annual salary + commission for all 
salesman
avg(sal+comm)*12 23,400

SELECT AVG(COALESCE(SAL, 0) + COALESCE(COMM, 0))*12 AS Average_Annual_Salary
FROM EMP
WHERE JOB = 'SALESMAN';

3) Find the highest and lowest paid employees and the difference 
between them
max(sal) 5,000
min(sal) 800
max(sal)-min(sal) 4200

SELECT MAX(SAL) AS MAX_SALARY, MIN(SAL) AS MIN_SALARY, MAX(SAL)-MIN(SAL) AS SALARY_DIFF
FROM EMP
 
4) Find the number of characters in the longest department name
max(length(dname)) 10

SELECT MAX(LENGTH(DNAME)) AS Longest_Department_Name_Length
FROM DEPT;

 
5) Count the number of people in department 30 who receive 
a salary and the number of people who receive a commission
count(sal) 6
count(comm) 4

SELECT COUNT(CASE WHEN SAL IS NOT NULL THEN 1 END) AS Number_of_Salary,
    COUNT(CASE WHEN COMM IS NOT NULL THEN 1 END) AS Number_of_Comm
FROM EMP
WHERE DEPTNO = 30;

6) List the average commission of employees who receive a 
commission and the average commission of all employees (treating 
employees who do not receive a commission as receiving a zero 
commission)
avg(comm) 550
avg(nvl(comm,0)) 157.142857

SELECT 
  AVG(COMM) AS Average_Comm,
  AVG(NVL(COMM, 0)) AS Average_Comm_ALL
FROM EMP;
 
7) List the average salary of employees that receive a salary, 
the average commission of employees that receive a commission, 
the average salary plus commission of only those employees that 
receive a commission and average salary plus commission of all 
employees including those who do not receive a commission
avg(sal) 2,073.21
avg(comm) 550.00
avg(sal+comm) 1,950.00
avg(sal+nvl(comm,0)) 1,933.23

SELECT AVG(SAL), AVG(COMM), AVG(SAL + COMM), AVG(SAL + NVL(COMM, 0))
FROM EMP
 
8) Compute the daily and hourly salaries for emplyees 
in department 30. Round the results to the nearest penny. Assume 
there are 22 working days in a month and 8 working hours in a day.

SELECT ENAME, ROUND(SAL / 22, 2) AS DAILY_WAGE, 
    ROUND(SAL/22/8, 2) AS HOURLY_WAGE
FROM EMP
WHERE DEPTNO = 30 

9) Issue the same query as the previous one except that this time 
truncate (trunc) to the nearest penny rather than round.

SELECT ENAME, TRUNC(SAL / 22, 2) AS DAILY_WAGE, 
    TRUNC(SAL/22/8, 2) AS HOURLY_WAGE
FROM EMP
WHERE DEPTNO = 30

In [ ]:
Exercise 3: dates
 
1) Select the name, job and hiredate of the employees in dept 20 
(format the hiredate column using a picture of mm/dd/yy)

SELECT ENAME,JOB, TO_CHAR(HIREDATE, 'MM/DD/YY') AS Formatted_HireDate
FROM EMP
WHERE DEPTNO = 30

2) Use a picture to format hiredate as: day (day of the week), 
month (name of the month), dd (day of the month) and yyyy (year). 
e.g. wednesday, january, 12, 1983

SELECT TO_CHAR(HIREDATE, 'Day, Month, DD, YYYY') AS Formatted_Hiredate
FROM EMP;
WHERE DEPTNO = 30
 
3) Use the format mask suffix 'th' in a picture (oracle will put 
a suffix after the field (ddth).)

Just add TH TO DD IN THE PREVIOUS QUERY

4) Select the name and hiredate of department 20's employees in 
the following format:
 
ename, hiredate
adams, january 12th, 1983, 11:05 am

SELECT
    LOWER(ENAME) || ', ' ||
    TO_CHAR(HIREDATE, 'Month DDth, YYYY, HH MI AM') AS Formatted_Info
FROM EMP
WHERE DEPTNO = 20;